Revit 2027 API
FootPrintRoof.Overhang Property
Retrieve or set the Overhang of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double this[
	ModelCurve pCurve
] { get; set; }
Public Property Overhang (
	pCurve As ModelCurve
) As Double
	Get
	Set
public:
property double Overhang[ModelCurve^ pCurve] {
	double get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, double value);
}
member Overhang : float with get, set
Parameters
pCurve ModelCurve
Property Value
Double
Remarks
Only applicable when the FootPrintRoof is created with Pick Walls.
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace